In [1]:
my_dictionary={
    "name":["violet","judy","mark","james","linda","joseph","hilda"],
    "maths":[80,60,70,90,78,69,73],
    "english":[67,76,87,46,60,70,53],
    "science":[79,60,80,96,57,84,70],
}

In [2]:
print(my_dictionary)

{'name': ['violet', 'judy', 'mark', 'james', 'linda', 'joseph', 'hilda'], 'maths': [80, 60, 70, 90, 78, 69, 73], 'english': [67, 76, 87, 46, 60, 70, 53], 'science': [79, 60, 80, 96, 57, 84, 70]}

In [3]:
for key, values in my_dictionary.items():
    print(key, values)

name ['violet', 'judy', 'mark', 'james', 'linda', 'joseph', 'hilda']
maths [80, 60, 70, 90, 78, 69, 73]
english [67, 76, 87, 46, 60, 70, 53]
science [79, 60, 80, 96, 57, 84, 70]

In [13]:
import pandas as pd

In [15]:
df=pd.DataFrame(my_dictionary)

In [16]:
df

     name  maths  english  science
0  violet     80       67       79
1    judy     60       76       60
2    mark     70       87       80
3   james     90       46       96
4   linda     78       60       57
5  joseph     69       70       84
6   hilda     73       53       70

In [23]:
df["average"]=df[["maths","english","science"]].mean(axis=1)

In [24]:
df

     name  maths  english  science    average
0  violet     80       67       79  75.333333
1    judy     60       76       60  65.333333
2    mark     70       87       80  79.000000
3   james     90       46       96  77.333333
4   linda     78       60       57  65.000000
5  joseph     69       70       84  74.333333
6   hilda     73       53       70  65.333333

In [25]:
df.sort_values(by="average",ascending=False)

     name  maths  english  science    average
2    mark     70       87       80  79.000000
3   james     90       46       96  77.333333
0  violet     80       67       79  75.333333
5  joseph     69       70       84  74.333333
1    judy     60       76       60  65.333333
6   hilda     73       53       70  65.333333
4   linda     78       60       57  65.000000